absorpt
acceler
acid
act
adapt
advantag
agricultur
air
alken
alkyn
allergi
amino
anabol
ancestor
ancient
andrea
anim
animalcul
annelid
aquacultur
aquat
aquif
area
argon
aromat
around
asteroid
asthma
astronomi
atmospher
atom
aurora
autoimmun
avail
averag
avoid
bacteria
bad
balanc
ball
bang
base
bathymetr
beagl
beat
belt
benefit
bentho
beyond
big
billiard
biochem
biolog
biomass
biospher
black
blood
bodi
bond
bone
brain
branch
break
breath
breed
bronchiti
brood
build
burn
calcul
caldera
canal
cancer
canyon
capac
carbohydr
carbon
cardiovascular
carri
cartilag
cartilagin
cast
catabol
catalyst
caus
cave
cell
cellular
cellulos
cenozo
center
central
cerebrum
chain
chang
characterist
charg
chemic
chemistri
chromospher
classif
classifi
clean
cleanup
climat
climatologi
cloud
cluster
coal
coastal
cold
color
column
come
comet
common
composit
compound
compress
comput
concentr
condit
conduct
conductor
consequ
conserv
constel
construct
consumpt
contact
contamin
contin
continent
contour
control
convect
converg
cord
core
corioli
corkscrew
corona
correct
crater
craton
creat
creation
crude
crust
crystal
crystallin
current
cycl
dai
dalton
danger
darwin
date
decai
deep
defin
definit
densiti
deplet
deposit
dermi
destroi
destruct
detect
develop
diabet
diagram
diamond
differ
digest
direct
disadvantag
disast
discharg
discov
discoveri
diseas
divers
divid
divis
doctor
dot
drift
drink
drug
dwarf
dynam
earli
earth
earthquak
eat
echoloc
eclips
ecologi
ectothermi
effect
electr
electromagnet
electron
element
elimin
ellipt
emphysema
enceph
endocrin
endoskeleton
endothermi
energi
enough
enter
environ
environment
enzym
epidermi
equinox
era
eri
eros
erupt
esophagu
evapor
evid
evolut
evolv
except
exchang
excret
excretori
exercis
exospher
experi
explain
explor
explos
extent
extrasolar
extrem
faci
factor
farsighted
fault
featur
fece
feed
feedback
field
finch
fish
flare
flatworm
flood
flow
fluid
fold
food
form
format
fossil
foucault
fractur
friction
fuel
fulleren
fun
function
fusion
galaxi
galileo
garbag
gasolin
gastrointestin
gene
geocentr
geolog
geologi
geotherm
geyser
giant
glaciat
glacier
gland
global
good
grand
graphit
graviti
great
greek
green
greenhous
groundwat
gulf
hair
half
hand
happen
haumea
hazard
health
healthi
hear
heart
heat
heliocentr
hemispher
hexagon
histori
hole
homeostasi
hominid
hook
hormon
hot
household
human
hydrocarbon
hydropow
hypothalamu
illumin
imbalanc
impact
imperm
import
impuls
incandesc
industri
infect
infecti
influenc
infrar
injuri
inner
insul
integumentari
interfer
interior
intern
interpret
interv
intestin
introduct
invent
invers
ionospher
irregular
isotop
issu
joint
jupit
keep
kepler
kidnei
lake
land
larg
larva
late
latitud
law
layer
lead
leeuwenhoek
lens
life
lifetim
light
lightn
limit
line
lipid
liquid
lobe
longshor
look
loop
loss
love
luminesc
lunar
lung
machin
macronutri
magnet
magnetospher
main
maintain
makemak
map
maria
marin
mass
matter
measur
mechan
mening
mesopaus
mesospher
mesozo
metabol
metal
metamorph
metamorphosi
meteor
meteorit
meteoroid
meteorologi
method
mexico
micronutri
microscop
middl
milki
miller
miner
mission
mix
model
modern
modular
mold
mollusk
monitor
moon
motion
motor
mountain
mouth
move
movement
multi
municip
nail
natur
navig
neap
near
nearsighted
nebula
need
nekton
neptun
nerv
nervou
neuron
neutron
newton
night
nina
nino
non
noninfecti
normal
north
northern
nuclear
nutrient
object
observ
observatori
occur
ocean
oceanographi
oil
optic
orbit
organ
origin
oscil
osteoporosi
other
outer
overpopul
oxygen
ozon
pacif
paleozo
part
particl
patch
pathogen
pendulum
period
peripher
perminer
petroleum
phase
photochem
photospher
photosynthesi
pigment
pituitari
planet
planetari
plankton
plant
plate
platform
pleistocen
plug
plume
pluto
pneumonia
point
poison
polar
pollut
poor
popul
porou
posit
potassium
power
precambrian
presenc
preserv
prevent
primat
problem
process
produc
product
promin
properti
protect
protein
proton
pullei
qualiti
race
radi
radiat
radio
radioact
radiocarbon
radioisotop
radiometr
rainfal
rate
reach
reactant
reaction
reactiv
reason
recent
recreat
recycl
red
reduc
refin
reflect
region
regress
regularli
reintroduc
relat
remain
remedi
renew
replac
repres
reproduc
reproduct
resourc
respir
respiratori
rest
reus
revolut
rey
rift
ring
river
rock
rocket
role
roll
rotat
roundworm
safe
safeti
salin
san
satellit
saturn
scarciti
scarsiti
scienc
scientif
scientist
sea
season
seawat
sediment
see
segment
seismic
select
sens
sensori
separ
sequenc
shape
shield
shorelin
short
shortag
shuttl
sick
sinkhol
size
skelet
skin
slide
slip
slow
small
smell
smog
smoke
soil
solar
sonar
sourc
southern
space
spawn
spectromet
spectrum
speed
spill
spinal
spiral
sprain
spread
spring
sputnik
stage
stai
stand
star
starch
starlight
static
station
step
stomach
storm
stormi
stratopaus
stratospher
stream
strength
stress
strike
structur
studi
subduct
sugar
summer
sun
sunspot
supercontin
supergi
supernova
superord
supervolcano
suppli
surfac
surg
synaps
syndrom
system
tabl
target
tast
tecton
teeth
telescop
televis
temperatur
term
theori
thermal
thermospher
tide
time
tissu
togeth
topograph
tortois
touch
toxic
tract
trait
transfer
transgress
transmiss
transport
trash
treat
treatment
tree
tropopaus
tropospher
tsunami
tuberculosi
type
ultrasonographi
ultrasound
ultraviolet
univers
unsatur
upwel
uranium
uranu
urei
urin
urinari
valenc
vallei
van
varv
vector
veloc
venu
vertebr
vessel
view
visibl
vision
visit
vitamin
volcano
voyag
warm
wash
wast
wastewat
water
waterborn
waterfal
wave
wavelength
wealth
weight
well
wheelbarrow
white
wind
winter
work
world
year
yellowston
zone
